{
  "Aragorn": "Heir of Isildur and last chieftain of the Dúnedain; spends much of his life safeguarding the North as a ranger before becoming King Elessar and restoring the Reunited Kingdom.",
  "Arwen": "Daughter of Elrond and descendant of Lúthien; chooses a mortal life to marry Aragorn, marking the passing of the Elves and the rise of Men in Middle-earth.",
  "Elrond": "Half-elven lord of Rivendell noted for his healing, counsel, and long stewardship; bearer of Vilya and one of the principal leaders of the Free Peoples.",
  "Celebrian": "Daughter of Galadriel and Celeborn and wife of Elrond; after being captured and wounded by orcs, she departs Middle-earth for Valinor to seek healing.",
  "Sauron": "A Maia who served Morgoth before becoming the second Dark Lord; forges the One Ring to control the other Rings of Power and dominate Middle-earth.",
  "Gandalf": "One of the Istari sent by the Valar; known for humility, wisdom, and perseverance, playing a crucial role in uniting the Free Peoples against Sauron.",
  "Saruman": "Initially head of the Istari and foremost in knowledge of the Rings; later corrupted by pride and a desire for power, leading to his betrayal of the West.",
  "Witch-king": "Chief of the Nazgûl and Sauron’s most powerful servant; a former human king turned wraith who commands Sauron’s forces until his death at the Pelennor Fields.",
  "Nazgul 2": "One of the Nine Ringwraiths whose specific identity and history are largely unknown; enslaved to Sauron through the power of a Ring of Power.",
  "Nazgul 3": "A member of the Nine whose individual deeds are not detailed in canon; participates in the pursuit of the Ring and in Sauron’s military campaigns.",
  "Nazgul 4": "One of the Ringwraiths, originally a mortal king; like the others, eventually abandons horses for fell beasts as Sauron’s power grows.",
  "Nazgul 5": "A wraith among the Nine, once a human ruler granted a Ring of Power; his personal background is not recorded in Tolkien’s texts.",
  "Nazgul 6": "One of the Nine Riders; individual attributes are unspecified, though all serve as Sauron’s hunters and agents during the War of the Ring.",
  "Nazgul 7": "A Ringwraith who participates in the major assaults on the West; canon provides no distinct personal traits beyond his role among the Nine.",
  "Nazgul 8": "One of the Nazgûl whose mortal identity has been lost; acts as a subordinate of the Witch-king in Sauron’s campaigns.",
  "Nazgul 9": "One of the Nine human kings corrupted through the Rings of Power; participates in the search for the Ring-bearer and the siege of Gondor.",
  "Frodo": "A hobbit of the Shire entrusted with the One Ring; his resilience and moral strength allow him to reach Mount Doom despite the Ring’s influence.",
  "Samwise": "Frodo’s loyal companion and gardener; noted for his perseverance and devotion, repeatedly sustaining the Ring-bearer and ensuring the quest’s completion.",
  "Meriadoc": "Merry Brandybuck, a perceptive and courageous hobbit; takes part in the War of the Ring and aids in the downfall of the Witch-king.",
  "Peregrin": "Pippin Took, the youngest member of the Fellowship; grows in responsibility through his service in Gondor and contributes to several key events.",
  "Bilbo": "A hobbit who acquires the One Ring during the Quest of Erebor; later preserves its history and passes it to Frodo at the start of the Third Age’s final crisis.",
  "Gollum": "Once the hobbit-like Sméagol; transformed by centuries of Ring possession, torn between lingering pity and obsessive attachment to the Ring.",
  "Legolas": "A Sindarin elf-prince of the Woodland Realm; a skilled archer and member of the Fellowship known for keen senses and swift movement.",
  "Galadriel": "Lady of Lothlórien and bearer of Nenya; one of the most powerful Elves in Middle-earth, offering guidance and protection to the Fellowship.",
  "Celeborn": "Lord of Lothlórien and husband of Galadriel; a seasoned leader associated with the defense and governance of the Golden Wood.",
  "Glorfindel": "An Elf-lord of great power who returned from Valinor; plays a significant role in opposing the Nazgûl and aiding the Free Peoples.",
  "Gimli": "A dwarf of Durin’s Folk and member of the Fellowship; distinguished warrior whose friendship with Legolas bridges old enmities.",
  "Boromir": "Eldest son of Denethor II; valiant but tempted by the Ring, ultimately redeemed through his defense of Merry and Pippin.",
  "Faramir": "Younger son of Denethor II; respected for insight and integrity, resists the Ring and later becomes Steward of Gondor.",
  "Denethor": "Steward of Gondor during the War of the Ring; reliance on the palantír contributes to his despair and tragic end.",
  "Théoden": "King of Rohan who, after recovering from Saruman’s influence, leads his riders in war and falls at the Battle of the Pelennor Fields.",
  "Éowyn": "A noblewoman of Rohan who disguises herself to ride to war; slays the Witch-king during the siege of Minas Tirith.",
  "Éomer": "Marshal of the Riddermark and nephew of Théoden; succeeds to the throne of Rohan and leads his people with martial skill.",
  "Isildur": "Son of Elendil who cuts the One Ring from Sauron but refuses to destroy it; later killed by orcs at the Gladden Fields.",
  "Anárion": "Brother of Isildur and co-founder of Gondor; instrumental in establishing its early cities and dies in the war against Sauron.",
  "Elendil": "Leader of the Faithful who survives Númenor’s downfall; founds the realms of Arnor and Gondor and dies fighting Sauron beside Gil-galad.",
  "Thranduil": "Elvenking of northern Mirkwood; a long-lived ruler known for caution and for leading his realm through many conflicts.",
  "Tauriel": "A Woodland Realm captain introduced in later adaptations; noted for her skill in archery and for differing from Thranduil’s isolationist stance.",
  "Elros": "Brother of Elrond who chooses mortality; becomes the first King of Númenor and forebear of the Númenórean royal line.",
  "Tar-Míriel": "Rightful heir to the throne of Númenor who is compelled to marry Ar-Pharazôn; her fate is tied to the downfall of the kingdom.",
  "Ar-Pharazôn": "Last king of Númenor whose pride leads him to challenge the Valar and bring Sauron to the island, precipitating Númenor’s destruction.",
  "Thingol": "King of Doriath and husband of Melian; his rule ends amid conflict arising from the Silmaril and disputes with the Dwarves.",
  "Melian": "A Maia who becomes queen of Doriath through marriage to Thingol; maintains the Girdle of Melian, protecting the realm for centuries.",
  "Lúthien": "Daughter of Thingol and Melian; renowned for her deeds with Beren, including winning a Silmaril from Morgoth’s crown.",
  "Beren": "A mortal hero who loves Lúthien and undertakes a perilous quest to obtain a Silmaril from Morgoth, altering the course of the First Age.",
  "Húrin": "Lord of the House of Hador who defies Morgoth at the Nirnaeth Arnoediad; later cursed to witness the doom of his family.",
  "Huor": "Brother of Húrin and father of Tuor; slain in the Nirnaeth Arnoediad after prophesying hope through his line.",
  "Morwen": "Wife of Húrin and mother of Túrin and Niënor; known for her strength and endurance amid the tragedies of her family.",
  "Rían": "Wife of Huor and mother of Tuor; entrusts her son to the Grey Elves and dies of grief after her husband’s death.",
  "Fëanor": "Creator of the Silmarils and a central figure of the Noldor; his oath and resolve greatly influence the tragedies of the First Age.",
  "Fingolfin": "High King of the Noldor renowned for courage; challenges Morgoth in single combat and wounds him before falling.",
  "Finarfin": "Brother of Fëanor who remains in Valinor during the exile; becomes High King of the Noldor there and leads with moderation.",
  "Maedhros": "Eldest son of Fëanor; endures long captivity and struggles between duty and the constraints of the Oath.",
  "Maglor": "Son of Fëanor and renowned singer; wanders in sorrow after the wars, burdened by the deeds committed under the Oath.",
  "Finrod": "King of Nargothrond who aids Barahir’s line; fulfills his vow by giving his life to save Beren from Sauron.",
  "Celebrimbor": "Elven-smith of Eregion and descendant of Fëanor; forges the Three Rings and resists Sauron before being captured and killed.",
  "Turgon": "King of Gondolin who establishes the hidden city in secrecy; his realm’s fall becomes a pivotal event of the First Age.",
  "Idril": "Daughter of Turgon whose foresight leads her to prepare an escape route from Gondolin, ensuring the survival of many.",
  "Tuor": "A mortal guided by Ulmo to warn Gondolin; becomes father of Eärendil and one of the few humans closely linked with Elven destiny.",
  "Eärendil": "Mariner of half-elven descent who sails to Valinor with a Silmaril seeking aid; later set among the stars as a symbol of hope.",
  "Elwing": "Bearer of a Silmaril who escapes an assault by taking bird-form; joins Eärendil and shares his destiny in the West.",
  "Círdan": "Ancient Elf and master shipwright of the Grey Havens; original bearer of Narya and guardian of the vessels sailing West.",
  "Durin I": "Earliest known king of Khazad-dûm and ancestor of Durin’s line; revered among the Longbeards.",
  "Thorin": "Leader of the Quest of Erebor and prince of Durin’s Folk; struggles with dragon-sickness before dying honorably in battle.",
  "Balin": "Dwarf of Thorin’s company; later leads an attempt to reclaim Moria, where he is slain during the colony’s fall.",
  "Dwalin": "Veteran warrior of Durin’s Folk and companion of Thorin; known for his steadfast loyalty and martial strength.",
  "Treebeard": "One of the oldest Ents of Middle-earth; rouses the Ents against Isengard after learning of the forests’ destruction.",
  "Smaug": "Powerful fire-drake who seizes Erebor and hoards its treasure until slain by Bard, reshaping the politics of the region.",
  "Tom_Bombadil": "An enigmatic being of great age and unclear nature; remains unaffected by the One Ring and lives apart from the struggles of Middle-earth.",
  "Goldberry": "Known as the River-daughter and wife of Tom Bombadil; associated with natural harmony and the life of the Withywindle valley.",
  "Ungoliant": "A shadowy and ancient creature allied with Morgoth in the destruction of the Two Trees; later turns against him in hunger.",
  "Shelob": "A descendant of Ungoliant dwelling in Cirith Ungol; preys on travelers and attacks Frodo during the quest.",
  "Morgoth": "Melkor, mightiest of the Valar who rebels against creation; source of much of the evil in Arda and first Dark Lord.",
  "Manwë": "King of the Valar and lord of winds and airs; closest in purpose to Ilúvatar and chief guardian of the world’s order.",
  "Varda": "Queen of the Valar, revered by Elves for creating the stars; her light stands in opposition to darkness throughout the ages.",
  "Ulmo": "Vala of waters who seldom appears directly; guides events through dreams, music, and influence over seas and rivers.",
  "Aulë": "Vala of craft and creation who shapes much of Arda; creator of the Dwarves and master of artisanship.",
  "Yavanna": "Vala of growing things and protector of forests; creator of the Two Trees and guardian of living nature.",
  "Mandos": "Námo, judge of the dead and keeper of the Halls of Mandos; pronounces dooms that shape Elven and mortal fate.",
  "Nienna": "Vala associated with pity, mourning, and endurance; her teachings influence healing and compassion among the peoples of Arda."
}
